# for i in range(1,11):
#     print(i)

# Написати код який буде просити ім'я користувача до поки він його не напише

# while True:
#     name = input('Enter your name: ')
#     if name.strip():
#         print(f'Hello {name}')
#         break


# Написати код який рахує суму всіх чисел в діапазоні який задав користувач

# num1 = int(input('Enter num1:'))
# num2 = int(input('Enter num2:'))

# result = 0

# for i in range(num1, num2 + 1):
#     result += i
# print(result)

# Написати програму, яка виведе число від -10 до -1 використовуючи цикл

# for i in range(-10, 0):
#     print(i)


# Дано змінну a = 1. Виводити a, поки a <= 15.

# a = 1

# while a <= 15:
#     print(a)
#     a += 1


# Написати програму, яка додасть “Hello” до кожного із імен в списку і виведе привітання на екран. lst=["Dima", "Yaroslav", "Zhenya", "Sasha", "Andrii", "Max"]. Приклад — Hello Dima!
lst=["Dima", "Yaroslav", "Zhenya", "Sasha", "Andrii", "Max"]

# for name in lst:
#     print(f'Hello, {name}')

# Дано слово “Цивілізація”. За допомогою циклу порахувати скільки літер “і” містить в собі це слово.
# Зробити попередню програму більш універсальною — Запитувати у користувача слово та літеру для пошуку.
# word = 'Civilization'
# word = input('Enter word: ')
# letter = input('Enter letter: ')

# count = 0

# for x in word:
#     if x == letter:
#         count += 1

# print(count)

# Написати програму, яка порахує і виведе куби всіх чисел від 1 до числа, яке задасть користувач
# num = int(input('Enter num > 1: '))

# for i in range(1, num + 1):
#     print(i ** 3)


a = 'lorem ipsum'

