# Створіть рядок та використайте зрізи для виводу перших трьох та останніх трьох символів.

s1 = 'hello python'

s2 = s1[0:3]
s3 = s1[-3:]

# print(s2)
# print(s3)


# Створіть множину та перевірте, чи є вона підмножиною іншої множини.(можна використати методи типу union, difference і тд)

a = {1,2,3,4,5}
b = {2,3,4}

c = a.difference(b)

d = b.issubset(a)
# print(d)

t = set('hello')
# print(t)


# кортеж tuple

t1 = (1,2,3,4, 'sdfsdf', ['asdadad', 1])

# print(t1[2])

t2 = (1,2,3)
t3 = (4,5,6)

t4 = t2 + t3
print(t4)

t5 = t1 * 3
print(t5)

#index 
t6 = ('Misha', '22-02-1999', 25)
t7 = t6.index(25)
# print(t7)


# count
t9 = (1,1,1,1,1,1,1,1,2,3,4,5)
# print(t9.count(1))


# Создайте функцию, которая принимает два кортежа и возвращает количество элементов, которые встречаются в обоих кортежах.

def common(x, y):
    comm = set(x) & set(y)
    return len(comm)

a = (1,1,1,2,3,4,5)
b = (1,2,3,4,5,6,7,8)

print(common(a, b))